<h2 id="exercises-i">Exercises I</h2>
<p>Run <code>python -m pip install pymysql</code> from your terminal to install pymysql.</p>
<p>Create a notebook or python script named <code>advanced_dataframes</code> to do your work in for these exercises.</p>

1. Run <code>python -m pip install pymysql</code> from your terminal to install the mysql client (any folder is fine)</li>

2. cd into your exercises folder for this module and run <code>echo env.py &gt;&gt; .gitignore</code></li>

3. <p>Create a function named <code>get_db_url</code>. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.</p>

In [1]:
import pandas as pd
import numpy as np

In [2]:
def get_db_url(db_name):
    from env import user, host, password
    return f'mysql+pymysql://{user}:{password}@{host}/employees'

4. <p>Use your function to obtain a connection to the <code>employees</code> database.</p>

In [4]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

5. <p>Once you have successfully run a query:</p>
<p>a. Intentionally make a typo in the database url. What kind of error message do you see?</p>

In [6]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', mysql+pymysql://hopper_1545:password@157.230.209.171/employees)

SyntaxError: invalid syntax (<ipython-input-6-c403364f985e>, line 1)

<p>b. Intentionally make an error in your SQL query. What does the error message look like?</p>

In [7]:
pd.read_sql('SELECT * FROM emploees LIMIT 5 OFFSET 50', url)

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.emploees' doesn't exist")
[SQL: SELECT * FROM emploees LIMIT 5 OFFSET 50]
(Background on this error at: http://sqlalche.me/e/14/f405)

6. <p>Read the <code>employees</code> and <code>titles</code> tables into two separate DataFrames.</p>

In [8]:
employees = pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

In [9]:
employees

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [13]:
def get_db_url(db_name):
    from env import user, host, password
    return f'mysql+pymysql://{user}:{password}@{host}/titles'

In [14]:
url2 = get_db_url('titles')

7. <p>How many rows and columns do you have in each DataFrame? Is that what you expected?</p>

In [21]:
query = '''
SELECT
    t.title as title,
    d.dept_name as dept_name,
    t.to_date as to_date,
    t.from_date as from_date
FROM titles t
JOIN dept_emp USING (emp_no)
JOIN departments d USING (dept_no)
LIMIT 100
'''

title_dept = pd.read_sql(query, url)
title_dept.head()

          title         dept_name     to_date   from_date
0         Staff  Customer Service  1996-11-09  1990-01-22
1  Senior Staff  Customer Service  9999-01-01  1996-09-20
2         Staff  Customer Service  1996-09-20  1989-09-20
3  Senior Staff  Customer Service  9999-01-01  2000-05-04
4         Staff  Customer Service  2000-05-04  1992-05-04

8. <p>Display the summary statistics for each DataFrame.</p>

In [22]:
employees.describe()

             emp_no
count      5.000000
mean   10053.000000
std        1.581139
min    10051.000000
25%    10052.000000
50%    10053.000000
75%    10054.000000
max    10055.000000

In [19]:
title_dept.describe()

        title         dept_name
count     100               100
unique      4                 1
top     Staff  Customer Service
freq       48               100

9. <p>How many unique titles are in the <code>titles</code> DataFrame?</p>

In [ ]:
# 4

10. <p>What is the oldest date in the <code>to_date</code> column? </p>

In [31]:
title_dept.sort_values(by = 'to_date', ascending = True).head(1)

    title         dept_name     to_date   from_date
76  Staff  Customer Service  1991-01-08  1986-01-08

In [34]:
title_dept[title_dept.to_date == title_dept.to_date.min()]

    title         dept_name     to_date   from_date
76  Staff  Customer Service  1991-01-08  1986-01-08

11. <p>What is the most recent date in the <code>to_date</code> column?</p>

In [32]:
title_dept.sort_values(by = 'to_date', ascending = False)

              title         dept_name     to_date   from_date
50     Senior Staff  Customer Service  9999-01-01  1996-08-12
31            Staff  Customer Service  9999-01-01  1998-09-09
34         Engineer  Customer Service  9999-01-01  1995-04-26
36            Staff  Customer Service  9999-01-01  1998-02-15
37     Senior Staff  Customer Service  9999-01-01  1992-04-06
..              ...               ...         ...         ...
10  Senior Engineer  Customer Service  1992-12-11  1992-05-13
12            Staff  Customer Service  1992-05-24  1988-03-03
9          Engineer  Customer Service  1992-05-13  1985-05-13
14            Staff  Customer Service  1991-09-08  1985-09-08
76            Staff  Customer Service  1991-01-08  1986-01-08

[100 rows x 4 columns]

In [33]:
title_dept[title_dept.to_date == title_dept.to_date.max()]

              title         dept_name     to_date   from_date
1      Senior Staff  Customer Service  9999-01-01  1996-09-20
3      Senior Staff  Customer Service  9999-01-01  2000-05-04
5      Senior Staff  Customer Service  9999-01-01  1996-05-28
7      Senior Staff  Customer Service  9999-01-01  1993-09-02
11            Staff  Customer Service  9999-01-01  1998-05-01
13     Senior Staff  Customer Service  9999-01-01  1991-09-08
15     Senior Staff  Customer Service  9999-01-01  1995-06-07
17     Senior Staff  Customer Service  9999-01-01  1994-02-18
19            Staff  Customer Service  9999-01-01  1996-10-23
21  Senior Engineer  Customer Service  9999-01-01  1999-10-19
22     Senior Staff  Customer Service  9999-01-01  1999-12-22
24            Staff  Customer Service  9999-01-01  1996-08-11
25            Staff  Customer Service  9999-01-01  1997-12-26
26     Senior Staff  Customer Service  9999-01-01  2002-02-23
28            Staff  Customer Service  9999-01-01  1994-10-06
29     Senior Staff  Customer Service  9999-01-01  1993-03-31
30            Staff  Customer Service  9999-01-01  1995-12-14
31            Staff  Customer Service  9999-01-01  1998-09-09
34         Engineer  Customer Service  9999-01-01  1995-04-26
36            Staff  Customer Service  9999-01-01  1998-02-15
37     Senior Staff  Customer Service  9999-01-01  1992-04-06
38            Staff  Customer Service  9999-01-01  1999-12-29
39     Senior Staff  Customer Service  9999-01-01  1997-09-27
43     Senior Staff  Customer Service  9999-01-01  1999-01-07
46  Senior Engineer  Customer Service  9999-01-01  1996-11-20
47     Senior Staff  Customer Service  9999-01-01  1998-04-07
49  Senior Engineer  Customer Service  9999-01-01  1998-07-05
50     Senior Staff  Customer Service  9999-01-01  1996-08-12
52     Senior Staff  Customer Service  9999-01-01  1993-04-02
54     Senior Staff  Customer Service  9999-01-01  2001-12-11
57     Senior Staff  Customer Service  9999-01-01  1992-06-09
58     Senior Staff  Customer Service  9999-01-01  1997-04-20
60     Senior Staff  Customer Service  9999-01-01  1996-08-21
62     Senior Staff  Customer Service  9999-01-01  1997-03-01
66  Senior Engineer  Customer Service  9999-01-01  1998-03-03
68     Senior Staff  Customer Service  9999-01-01  2002-01-30
70     Senior Staff  Customer Service  9999-01-01  1998-06-23
71     Senior Staff  Customer Service  9999-01-01  1999-07-28
72     Senior Staff  Customer Service  9999-01-01  2001-11-17
74     Senior Staff  Customer Service  9999-01-01  1990-11-09
75     Senior Staff  Customer Service  9999-01-01  1991-01-08
77            Staff  Customer Service  9999-01-01  1999-08-29
78     Senior Staff  Customer Service  9999-01-01  1994-10-27
80            Staff  Customer Service  9999-01-01  1999-07-15
81     Senior Staff  Customer Service  9999-01-01  2002-02-19
83     Senior Staff  Customer Service  9999-01-01  1993-10-29
85     Senior Staff  Customer Service  9999-01-01  1996-04-01
88  Senior Engineer  Customer Service  9999-01-01  1999-12-30
89     Senior Staff  Customer Service  9999-01-01  1993-01-10
91     Senior Staff  Customer Service  9999-01-01  1997-02-03
93            Staff  Customer Service  9999-01-01  1998-01-26
94     Senior Staff  Customer Service  9999-01-01  1991-05-22
95     Senior Staff  Customer Service  9999-01-01  1998-12-26
97     Senior Staff  Customer Service  9999-01-01  1987-08-10
98     Senior Staff  Customer Service  9999-01-01  1997-01-21